{
  "departments_detailed": {
    "title": "Detailed Department Information",
    "source": "Official Website",
    "content": "DEPARTMENTS AT SATI:\n\n- ARTIFICIAL INTELLIGENCE: Artificial Intelligence - Samrat Ashok Technological Institute, Vidisha\n- APPLIED SCIENCE ALL/CHEMICAL ENGINEERING: Applied Chemistry - Samrat Ashok Technological Institute, Vidisha\n- APPLIED SCIENCE ALL/APPLIED MATHEMATICS: Applied Mathematics - Samrat Ashok Technological Institute, Vidisha\n- APPLIED SCIENCE ALL/APPLIED PHYSICS: Applied Physics - Samrat Ashok Technological Institute, Vidisha\n- CIVIL ENGINEERING: Civil Engineering - Samrat Ashok Technological Institute, Vidisha\n- COMPUTER SCIENCE ENGINEERING: Computer Science - Samrat Ashok Technological Institute, Vidisha\n- ELECTRICAL ENGINEERING: Electrical Engineering - Samrat Ashok Technological Institute, Vidisha\n- ELECTRONICS ENGINEERING: Electronics Engineering - Samrat Ashok Technological Institute, Vidisha\n- HUMANITIES: Humanities - Samrat Ashok Technological Institute, Vidisha\n- INFORMATION TECHNOLOGY: Information Technology - Samrat Ashok Technological Institute, Vidisha\n- MANAGEMENT STUDIES: Management Studies - Samrat Ashok Technological Institute, Vidisha\n- MECHANICAL ENGINEERING: Mechanical Engineering - Samrat Ashok Technological Institute, Vidisha\n- CYBER SECURITY IOT: Cyber Security & IoT - Samrat Ashok Technological Institute, Vidisha\n\nEach department has dedicated faculty, laboratories, and research facilities."
  },
  "current_notices_2025": {
    "title": "Current Notices & Updates (2025)",
    "source": "Official Website",
    "content": "RECENT NOTICES:\n\n- Important Notices\n\n\n\n\nAll\nAcademic\nExamination\nAdmission\nEvents\nTender\nRecruitment\nLibrary\n\n\n\n\n\n\n\n\n\n..."
  },
  "fee_structure_detailed": {
    "title": "Detailed Fee Structure",
    "source": "Official Website",
    "content": "FEE STRUCTURE INFORMATION:\n\n- Admission Courses - Samrat Ashok Technological Institute, Vidisha: https://www.satiengg.in/admission/admission-courses\n- Fee Structure - Samrat Ashok Technological Institute, Vidisha: https://www.satiengg.in/admission/fee-structure\n- Admission Notification - Samrat Ashok Technological Institute, Vidisha: https://www.satiengg.in/admission/latest-admission\n\nDetailed fee breakdowns are available on the official website."
  },
  "contact_detailed": {
    "title": "Detailed Contact Information",
    "source": "Official Website",
    "content": "CONTACT DETAILS:\n\nTechnical Support No: 8989011204\nEmail - satiengg01@gmail.com\n\nFor more information, visit the official website."
  }
}